read_verilog -sv -defer "/home/runner/work/Variant-ASIC-Explorer/Variant-ASIC-Explorer/designs/rns_crt/src/rns_crt_recon.v" "/home/runner/work/Variant-ASIC-Explorer/Variant-ASIC-Explorer/designs/rns_crt/src/rns_cu.v" "/home/runner/work/Variant-ASIC-Explorer/Variant-ASIC-Explorer/designs/rns_crt/src/rns_encoder.v" "/home/runner/work/Variant-ASIC-Explorer/Variant-ASIC-Explorer/designs/rns_crt/src/rns_slice.v" "/home/runner/work/Variant-ASIC-Explorer/Variant-ASIC-Explorer/designs/rns_crt/src/rns_top_crt.v"
hierarchy -check -top rns_top_crt
check
proc
opt
fsm
opt
memory
techmap
opt
check
tee -o stat.txt stat
tee -o stat.json stat -json
write_verilog -noattr -noexpr rns_top_crt_synth.v
