###############################################################################
# Created by write_sdc
###############################################################################
current_design rns_top_crt
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.2500 [get_ports {clk}]
set_clock_uncertainty 0.1000 clk
set_false_path\
    -from [get_ports {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
